<?
// показывать или нет выполненные задачи
$show_complete_tasks = rand(0, 1);

// устанавливаем часовой пояс в Московское время
date_default_timezone_set('Europe/Moscow');

$days = rand(-3, 3);
$task_deadline_ts = strtotime("+" . $days . " day midnight"); // метка времени даты выполнения задачи
$current_ts = strtotime('now midnight'); // текущая метка времени

// запишите сюда дату выполнения задачи в формате дд.мм.гггг
$date_deadline = date("d.m.Y", $task_deadline_ts);

// в эту переменную запишите кол-во дней до даты задачи
$days_until_deadline = floor(($task_deadline_ts - $current_ts)/86400);

$title = "Дела в порядке";

$categories = ["Все","Входящие","Учеба","Работа","Домашние дела","Авто"];

$tasks = [
["task" => "Собеседование в IT компании","deadline" => "01.06.2018","cat" => "Работа","done" => "Нет"],
["task" => "Выполнить тестовое задание","deadline" => "25.05.2018","cat" => "Работа","done" => "Нет"],
["task" => "Сделать задание первого раздела","deadline" => "21.04.2018","cat" => "Учеба","done" => "Да"],
["task" => "Встреча с другом","deadline" => "22.04.2018","cat" => "Входящие","done" => "Нет"],
["task" => "Купить корм для кота","deadline" => "Нет","cat" => "Домашние дела","done" => "Нет"],
["task" => "Заказать пиццу","deadline" => "Нет","cat" => "Домашние дела","done" => "Нет"]
];
?>
